tutorials/Influx_termalViscosity_incl0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0) //0
    (80 0 0)  //1
    (80 10 0)  //2
    (0 10 0)  //3

    (0 0 2) //4
    (80 0 2)  //5
    (80 10 2)  //6
    (0 10 2)  //7

    (0 0 8) //8
    (80 0 8)  //9
    (80 10 8)  //10
    (0 10 8)  //11

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (160 1 4) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11) (160 1 16) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type patch;
        faces
        (
            (0 4 7 3 0)
            (8 11 7 4)
        );
    }
    rightWall
    {
        type patch;
        faces
        (
            (5 6 10 9)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }


    front
    {
        type empty;
        faces
        (
            (11 10 6 7)
            (3 7 6 2)
        );
    }

    back
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
