tutorials/Influx_termalViscosity_incl0/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication setFields

runApplication decomposePar

# runApplication $(getApplication)

mpirun -np 4  interThermalFoam -parallel > log&

#------------------------------------------------------------------------------
